---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LeaderLeftAttachment
source: html/19364087-c0a1-6a55-988a-7796df4f66ac.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LeaderLeftAttachment Property

"Left Attachment"

## Syntax (C#)
```csharp
public static ForgeTypeId LeaderLeftAttachment { get; }
```